app/Controllers/AdminController.php

    public function listCategory()
    {
        $categorie = new CategoryPost();
        $allCategory = $categorie->findAll();
---
SELECT *
FROM `categorypost`

    public function postForm()
    {
        $category = new CategoryPost();
        $allCategory = $category->findAll();
---
SELECT *
FROM `categorypost`

        if (!$isValid) {
            // $errors = $validation->getErrors();
            $category = new CategoryPost();
            $allCategory = $category->findAll();
---
SELECT *
FROM `categorypost`

                    'featured_image' => $filename,
                );

                $save = $post->insert($data);
---
INSERT INTO `post` (`author_id`, `category_id`, `title`, `content`, `featured_image`) VALUES ('1', '2', 'Bienvenue', '<p>okdlkjflkjdsjfijrhkjfdskjkjkjfdkjdfknvkjdnkjvnskjncn,mcn,mncnjdncnsd,mnmdnd</p><p>&nbsp;</p><figure class=\"image\"><img style=\"aspect-ratio:596/721;\" src=\"/ckfinder/userfiles/files/Capture3.PNG\" width=\"596\" height=\"721\"></figure><p>Ceci est un test</p>', 'Capture2.PNG')

        public function listOffre()
    {
        $offre = new OffreModel();
        $allOffre = $offre->findAll();
---
SELECT *
FROM `offre`