app/Controllers/Newsletter.php

    public function formHandler()
    {
        $request = \Config\Services::request();

        $isValid = $this->validate([
            'email' => [
                'rules' => 'required|valid_email',
                'errors' => [
                    'required' => 'Veuillez renseigner le votre email',
                    'valid_email' => 'Veuillez saisir un email valid'
                ]
            ]
        ]);

        if (!$isValid) {
            $data = [
                'validation' => $this->validator
            ];
            return view('header') .
                view('home/index', $data) .
                view('footer');
        } else {
            $newsletter = new NewsletterModel();
            $save = $newsletter->save(['email' => $request->getVar('email')]);
---
INSERT INTO `newsletter` (`email`) VALUES ('kpontonauguste@gmail.com')