app/Controllers/Post.php

    public function index()
    {
        helper('text');

        $post = new PostModel();
        $allPost = $post->getAll();
        $recentPost = $post->recentPost();

        $category = new CategoryPost();
        $allCategory = $category->findAll();
---
SELECT *
FROM `categorypost`