app/Models/ContactModel.php

    public function  createC($data){
        $db = \Config\Database::connect();
        $builder = $db->table('contact')->insert($data);
---
INSERT INTO `contact` (`nom`, `prenom`, `email`, `telephone`, `message`) VALUES ('jkn', 'Daniella', 'admin@admin.com', '75877500', ' jhjb')