app/Models/PostModel.php

SELECT *
FROM `post`
JOIN `categorypost` ON `categorypost`.`id` = `post`.`category_id`
---
    public function getAll()
    {
        return $this->db->table('post')
            ->join('categorypost', 'categorypost.id = post.category_id')
            ->get();

SELECT *
FROM `post`
JOIN `categorypost` ON `categorypost`.`id` = `post`.`category_id`
JOIN `users` ON `users`.`id` = `post`.`author_id`
SELECT *
FROM `post`
 LIMIT 4, 1
SELECT COUNT(*) AS `numrows`
FROM `post`
---
    public function getAllWithPagination(?int $perPage = null): array
    {
        $this->db->table('post')
            ->join('categorypost', 'categorypost.id = post.category_id')
            ->join('users', 'users.id = post.author_id')
            ->get();

        return [
            'posts' => $this->paginate($perPage),
            'pager' => $this->pager
        ];

SELECT *
FROM `post`
WHERE `visibility` = 1
ORDER BY `created_at` DESC
 LIMIT 1, 6
---
    public function recentPost()
    {
        return $this->db->table('post')
            ->where('visibility', 1)
            ->limit(6, 1)
            ->orderBy('created_at', 'desc')
            ->get()
            ->getResultArray();