app/Models/Post.php

    public function getAll()
    {
        return $this->db->table('post')
            ->join('categorypost', 'categorypost.id = post.id')
            ->get()
            ->getResultArray();
---
SELECT *
FROM `post`
JOIN `categorypost` ON `categorypost`.`id` = `post`.`id`
JOIN `users` ON `users`.`id` = `post`.`author_id`