app/Models/PostulerModel.php

    public function  createP($data){
        $db = \Config\Database::connect();
        $builder = $db->table('postuler')->insert($data);
---
INSERT INTO `postuler` (`postuler_file`, `nom`, `prenom`, `email`, `adresse`, `telephone`, `date_naissance`, `diplome`) VALUES ('', 'eeeeee', 'w', 'admin@admin.com', 'kodjo city', '75877500', '23133', 'ddddd')